src/main/resources/descarga_solicitud.mustache

<s:Envelope xmlns:des="http://DescargaMasivaTerceros.sat.gob.mx" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
	<s:Header/>
	<s:Body>
		<des:SolicitaDescarga>
			<des:solicitud FechaFinal="{{FECHA_TERMINO}}" FechaInicial="{{FECHA_INICIAL}}"
				 {{#RFC_EMISOR}}RfcEmisor="{{RFC_EMISOR}}" {{/RFC_EMISOR}} RfcSolicitante="{{RFC_SOLICITANTE}}"
				  TipoSolicitud="{{TIPO_SOLICITUD}}" EstadoComprobante="1">
				 {{#RFC_RECEPTOR}}<des:RfcReceptores><des:RfcReceptor>{{RFC_RECEPTOR}}</des:RfcReceptor></des:RfcReceptores>{{/RFC_RECEPTOR}}
				<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
					<SignedInfo>
						<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
						<Reference URI="#_0">
							<Transforms>
								<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
							</Transforms>
							<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
							<DigestValue>{{&DIGEST_VALUE}}</DigestValue>
						</Reference>
					</SignedInfo>
					<SignatureValue>{{&SIGNATURE_VALUE}}</SignatureValue>
					<KeyInfo>
						<X509Data>
							<X509IssuerSerial>
								<X509IssuerName>{{&ISSUER_NAME}}</X509IssuerName>
								<X509SerialNumber>{{SERIAL_NUMBER}}</X509SerialNumber>
							</X509IssuerSerial>
							<X509Certificate>{{&CERTIFICADO}}</X509Certificate>
						</X509Data>
					</KeyInfo>
				</Signature>
			</des:solicitud>
		</des:SolicitaDescarga>
	</s:Body>
</s:Envelope>